; domain
;domain file for the problem 3.2 of the assigment
;definition of the emergency-service scenario

; ---------------------------------------------------

(define (domain emergency-service-extended)
    (:requirements :strips :typing :conditional-effects :negative-preconditions :disjunctive-preconditions :fluents) 

    (:types 

        location locatable content_type - object
        person box robot carrier content - locatable
    ) 

    (:constants
        
        agent - robot
        depot - location
        food medicine tool - content_type
    )

    (:predicates
        
        (at ?o - locatable ?l - location) ; locatable object is at location
        (contains ?b - box ?c - content) ; box contains the content
        (needs ?p - person ?t - content_type) ; person needs content of given type
        (instance_of ?c - content ?t - content_type) ; content is instance of given type
        (pulls ?r - robot ?cr - carrier) ; robot is pulling the carrier
        (carries ?cr - carrier ?b - box) ; carrier is carrying the box
        (is_emptying_at ?r - robot ?b - box ?l - location) ; robot is emptying box at given location
        
        (busy ?r - robot) ; robot is performing non-atomic action
        (empty ?b - box) ; box is empty (has no contents)
        (loadable ?b - box) ; box can be loaded (no robot has loaded it yet)
        (available ?c - content) ; content can be picked up (not contained in a box)
    )

    (:functions
        
        (max_load ?cr - carrier) ; FIXED: max boxes allowed for a given carrier
        (count_load ?cr - carrier) ; COUNTER: boxes loaded on the carrier
        (count_needs ?p - person) ; COUNTER: content types needed by a given person
        (count_needed ?t - content_type) ; COUNTER: people who need a given content type
        (count_needed_at ?t - content_type ?l - location) ; COUNTER: people who need a given content type at a specific location
    )

    ; NOTE: we assume the robot might fill a box even if it's not loaded
    ; NOTE: this design allows the robot to fill en empty box loaded by another robot
    ; fill a single box, if the box is empty and content, box and agent are all at the same location
    (:action fill
        :parameters (?r - robot ?b - box ?c - content ?t - content_type ?l - location)
        :precondition (and 
            (at ?r ?l) (at ?b ?l) (at ?c ?l) (not (busy ?r)) 
            (empty ?b) (available ?c) (instance_of ?c ?t)
            ; fill box only with content that someone needs somewhere
            ; (exists (?p - person) (needs ?p ?t))
            (> (count_needed ?t) 0)
        ) 
        :effect (and (contains ?b ?c) (not (empty ?b)) (not (available ?c)))
    )

    ; NOTE: in this domain emptying is NOT intended as an atomic action (serving one person at a time)
    ; NOTE: we assume that a robot can empty only a box carried by its own carrier
    ; NOTE: we assume the box to be still loaded on the robot after emptying
    ; NOTE: no need to check for position of other locatables since we check they're all attached to each other
    ; empty a box by dropping the content at the current location, and causing the people at the same location to have the content
    (:action empty
        :parameters (?r - robot ?cr - carrier ?b - box ?c - content ?t - content_type ?p - person ?l - location)
        :precondition (and 
            (at ?r ?l) (at ?p ?l) (pulls ?r ?cr) (carries ?cr ?b) 
            (contains ?b ?c) (instance_of ?c ?t) (needs ?p ?t)
            (or (not (busy ?r)) (is_emptying_at ?r ?b ?l))
        )
        :effect (and
            (busy ?r) (is_emptying_at ?r ?b ?l) (not (needs ?p ?t))
            ; "people" is plural, so we assume amount of content in a box is big enough for many people
            ; thus we also assume they will all get the content of the box, if they need it
            ; (forall (?p - person) (when (at ?p ?l) (and (owns ?p ?c) (not (needs ?p ?t)))))
            (decrease (count_needs ?p) 1)
            (decrease (count_needed ?t) 1) 
            (decrease (count_needed_at ?t ?l) 1)
        )
    )

    ; NOTE: in this domain emptying is NOT intended as an atomic action (serving one person at a time)
    ; NOTE: no need to check for position of other locatables since we check they're all attached to each other
    ; NOTE: after emptying, the effect actively changes position of content, since it's not in the box anymore
    ; change status of a box to empty (all people at location were served with content)
    (:action check_empty
        :parameters (?r - robot ?cr - carrier ?b - box ?c - content ?t - content_type ?l - location)
        :precondition (and 
            (at ?r ?l) (pulls ?r ?cr) (carries ?cr ?b) (contains ?b ?c) (instance_of ?c ?t)
            (busy ?r) (is_emptying_at ?r ?b ?l) (= (count_needed_at ?t ?l) 0)
        )
        :effect (and 
            (not (busy ?r)) (not (is_emptying_at ?r ?b ?l)) 
            (empty ?b) (not (contains ?b ?c)) (at ?c ?l)
        )
    )
    
    ; NOTE: no need to check for position of carrier since we check it's pulled by the robot
    ; pick up a single box and load it on the carrier, if it is at the same location as the box
    (:action pickup
        :parameters (?r - robot ?cr - carrier ?b - box ?l - location)
        :precondition (and 
            (at ?r ?l) (at ?b ?l) (not (busy ?r)) (pulls ?r ?cr) 
            (loadable ?b) (< (count_load ?cr) (max_load ?cr))
        )
        :effect (and (carries ?cr ?b) (not (loadable ?b)) (increase (count_load ?cr) 1))
    )

    ; NOTE: no need to change position of other locatables thanks to attached-aware logic
    ; move to another location (no matter if robot has anything attached or not)
    (:action move
        :parameters (?r - robot ?from - location ?to - location)
        :precondition (and (at ?r ?from) (not (busy ?r)))
        :effect (and (not (at ?r ?from)) (at ?r ?to))
    )     

    ; NOTE: no need to check for position of other locatables since we check they're all attached to each other
    ; NOTE: after deliver, the effect actively changes position of box, since it's not on the carrier anymore
    ; NOTE: no explicit mention to deliver only boxes that are full
    ; deliver a box to a specific person who is at the same location
    (:action deliver
        :parameters (?r - robot ?cr - carrier ?b - box ?p - person ?l - location)
        :precondition (and (at ?r ?l) (at ?p ?l) (not (busy ?r)) (pulls ?r ?cr) (carries ?cr ?b))
        :effect (and (at ?b ?l) (loadable ?b) (not (carries ?cr ?b)) (decrease (count_load ?cr) 1))
    )
)

; problem
(define (problem problem_two) (:domain emergency-service-extended)

(:objects 
    
    cr1 - carrier
    b1 b2 b3 b4 b5 - box
    l1 l2 l3 - location
    c1 c2 c3 c4 c5 c6 - content
    gizem daria indira savannah luca - person
)

(:init
    
    ; PEOPLE 
    (at gizem l1) (needs gizem medicine) (= (count_needs gizem) 1)
    (at daria l2) (needs daria medicine) (needs daria food) (= (count_needs daria) 2)
    (at indira l3) (needs indira tool) (needs indira food) (= (count_needs indira) 2)
    (at savannah l3) (needs savannah tool) (needs savannah food) (needs savannah medicine) (= (count_needs savannah) 3)
    (at luca depot) (= (count_needs luca) 0)

    ; NEED COUNTERS
    (= (count_needed medicine) 3)
    (= (count_needed food) 3)
    (= (count_needed tool) 2)

    (= (count_needed_at medicine l1) 1)
    (= (count_needed_at medicine l2) 1)
    (= (count_needed_at food l2) 1)
    (= (count_needed_at medicine l3) 1)
    (= (count_needed_at tool l3) 2)
    (= (count_needed_at food l3) 2)
    
    ; BOXES
    (at b1 depot) (empty b1) (loadable b1) 
    (at b2 depot) (empty b2) (loadable b2)
    (at b3 depot) (empty b3) (loadable b3)
    (at b4 depot) (empty b4) (loadable b4)
    (at b5 depot) (empty b5) (loadable b5)

    ; CONTENTS
    (at c1 depot) (available c1) (instance_of c1 food)
    (at c2 depot) (available c2) (instance_of c2 food)
    (at c3 depot) (available c3) (instance_of c3 medicine)
    (at c4 depot) (available c4) (instance_of c4 medicine)
    (at c5 depot) (available c5) (instance_of c5 medicine)
    (at c6 depot) (available c6) (instance_of c6 tool)

    ; CARRIERS
    (at cr1 depot) (= (count_load cr1) 0) (= (max_load cr1) 4)

    ; ROBOTS
    (at agent depot) (pulls agent cr1)
)

(:goal (and

    ; all people needs are successfully satified
    (forall (?p - person) (= (count_needs ?p) 0))

    ;; -----------------------------------------------------------------------
    ;; additional goal: make agent return to depot to be ready for new tasks
    (at agent depot)
))
)

; plan
1. (fill agent b1 c5 medicine depot)
   deleted: (empty b1) (available c5)
   added: (contains b1 c5)
   goals met: 1 of 2
2. (fill agent b3 c1 food depot)
   deleted: (empty b3) (available c1)
   added: (contains b3 c1)
   goals met: 1 of 2
3. (fill agent b4 c6 tool depot)
   deleted: (empty b4) (available c6)
   added: (contains b4 c6)
   goals met: 1 of 2
4. (pickup agent cr1 b2 depot)
   deleted: (loadable b2)
   added: (carries cr1 b2)
   changed: (count_load cr1) from 0 to 1
   goals met: 1 of 2
5. (pickup agent cr1 b1 depot)
   deleted: (loadable b1)
   added: (carries cr1 b1)
   changed: (count_load cr1) from 1 to 2
   goals met: 1 of 2
6. (pickup agent cr1 b3 depot)
   deleted: (loadable b3)
   added: (carries cr1 b3)
   changed: (count_load cr1) from 2 to 3
   goals met: 1 of 2
7. (pickup agent cr1 b4 depot)
   deleted: (loadable b4)
   added: (carries cr1 b4)
   changed: (count_load cr1) from 3 to 4
   goals met: 1 of 2
8. (fill agent b2 c3 medicine depot)
   deleted: (empty b2) (available c3)
   added: (contains b2 c3)
   goals met: 1 of 2
9. (move agent depot l2)
   deleted: (at agent depot)
   added: (at agent l2)
   goals met: 0 of 2
10. (empty agent cr1 b1 c5 medicine daria l2)
   deleted: (needs daria medicine)
   added: (busy agent) (is_emptying_at agent b1 l2)
   changed: (count_needs daria) from 2 to 1, (count_needed medicine) from 3 to 2, (count_needed_at medicine l2) from 1 to 0
   goals met: 0 of 2
11. (check_empty agent cr1 b1 c5 medicine l2)
   deleted: (busy agent) (is_emptying_at agent b1 l2) (contains b1 c5)
   added: (empty b1) (at c5 l2)
   goals met: 0 of 2
12. (move agent l2 depot)
   deleted: (at agent l2)
   added: (at agent depot)
   goals met: 1 of 2
13. (fill agent b1 c4 medicine depot)
   deleted: (empty b1) (available c4)
   added: (contains b1 c4)
   goals met: 1 of 2
14. (move agent depot l1)
   deleted: (at agent depot)
   added: (at agent l1)
   goals met: 0 of 2
15. (empty agent cr1 b2 c3 medicine gizem l1)
   deleted: (needs gizem medicine)
   added: (busy agent) (is_emptying_at agent b2 l1)
   changed: (count_needs gizem) from 1 to 0, (count_needed medicine) from 2 to 1, (count_needed_at medicine l1) from 1 to 0
   goals met: 0 of 2
16. (check_empty agent cr1 b2 c3 medicine l1)
   deleted: (busy agent) (is_emptying_at agent b2 l1) (contains b2 c3)
   added: (empty b2) (at c3 l1)
   goals met: 0 of 2
17. (move agent l1 depot)
   deleted: (at agent l1)
   added: (at agent depot)
   goals met: 1 of 2
18. (fill agent b2 c2 food depot)
   deleted: (empty b2) (available c2)
   added: (contains b2 c2)
   goals met: 1 of 2
19. (move agent depot l2)
   deleted: (at agent depot)
   added: (at agent l2)
   goals met: 0 of 2
20. (empty agent cr1 b2 c2 food daria l2)
   deleted: (needs daria food)
   added: (busy agent) (is_emptying_at agent b2 l2)
   changed: (count_needs daria) from 1 to 0, (count_needed food) from 3 to 2, (count_needed_at food l2) from 1 to 0
   goals met: 0 of 2
21. (check_empty agent cr1 b2 c2 food l2)
   deleted: (busy agent) (is_emptying_at agent b2 l2) (contains b2 c2)
   added: (empty b2) (at c2 l2)
   goals met: 0 of 2
22. (move agent l2 l3)
   deleted: (at agent l2)
   added: (at agent l3)
   goals met: 0 of 2
23. (empty agent cr1 b3 c1 food indira l3)
   deleted: (needs indira food)
   added: (busy agent) (is_emptying_at agent b3 l3)
   changed: (count_needs indira) from 2 to 1, (count_needed food) from 2 to 1, (count_needed_at food l3) from 2 to 1
   goals met: 0 of 2
24. (empty agent cr1 b3 c1 food savannah l3)
   deleted: (needs savannah food)
   changed: (count_needs savannah) from 3 to 2, (count_needed food) from 1 to 0, (count_needed_at food l3) from 1 to 0
   goals met: 0 of 2
25. (check_empty agent cr1 b3 c1 food l3)
   deleted: (busy agent) (is_emptying_at agent b3 l3) (contains b3 c1)
   added: (empty b3) (at c1 l3)
   goals met: 0 of 2
26. (empty agent cr1 b4 c6 tool indira l3)
   deleted: (needs indira tool)
   added: (busy agent) (is_emptying_at agent b4 l3)
   changed: (count_needs indira) from 1 to 0, (count_needed tool) from 2 to 1, (count_needed_at tool l3) from 2 to 1
   goals met: 0 of 2
27. (empty agent cr1 b4 c6 tool savannah l3)
   deleted: (needs savannah tool)
   changed: (count_needs savannah) from 2 to 1, (count_needed tool) from 1 to 0, (count_needed_at tool l3) from 1 to 0
   goals met: 0 of 2
28. (check_empty agent cr1 b4 c6 tool l3)
   deleted: (busy agent) (is_emptying_at agent b4 l3) (contains b4 c6)
   added: (empty b4) (at c6 l3)
   goals met: 0 of 2
29. (empty agent cr1 b1 c4 medicine savannah l3)
   deleted: (needs savannah medicine)
   added: (busy agent) (is_emptying_at agent b1 l3)
   changed: (count_needs savannah) from 1 to 0, (count_needed medicine) from 1 to 0, (count_needed_at medicine l3) from 1 to 0
   goals met: 1 of 2
30. (check_empty agent cr1 b1 c4 medicine l3)
   deleted: (busy agent) (is_emptying_at agent b1 l3) (contains b1 c4)
   added: (empty b1) (at c4 l3)
   goals met: 1 of 2
31. (move agent l3 depot)
   deleted: (at agent l3)
   added: (at agent depot)
   goals met: 2 of 2
